
## Plan Result




<pre><code>Plan: 15 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_application_insights.appinsights
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_resource_group.rg
  * module.my-time-database-v11.azurerm_postgresql_active_directory_administrator.admin
  * module.my-time-database-v11.azurerm_postgresql_database.postgres-db
  * module.my-time-database-v11.azurerm_postgresql_server.postgres-paas
  * module.my-time-database-v11.azurerm_private_endpoint.postgres[0]
  * module.my-time-database-v11.azurerm_resource_group.data-resourcegroup
  * module.my-time-database-v11.null_resource.set-user-permissions[0]
  * module.my-time-database-v11.random_password.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "my-time-api-appinsights-stg"
      + resource_group_name                   = "my-time-api-stg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "BuiltFrom"           = "https://github.com/HMCTS/my-time-api.git"
          + "application"         = "my-time"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#my-time-tech"
          + "environment"         = "staging"
          + "managedBy"           = "My Time - Tracking Leave Project"
        }
    }

  # azurerm_key_vault_secret.POSTGRES-PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/my-time-stg/providers/Microsoft.KeyVault/vaults/my-time-stg"
      + name           = "api-POSTGRES-PASS"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/my-time-stg/providers/Microsoft.KeyVault/vaults/my-time-stg"
      + name           = "api-POSTGRES-USER"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/my-time-stg/providers/Microsoft.KeyVault/vaults/my-time-stg"
      + name           = "api-POSTGRES-DATABASE"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/my-time-stg/providers/Microsoft.KeyVault/vaults/my-time-stg"
      + name           = "api-POSTGRES-HOST"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/my-time-stg/providers/Microsoft.KeyVault/vaults/my-time-stg"
      + name           = "api-POSTGRES-PORT"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/my-time-stg/providers/Microsoft.KeyVault/vaults/my-time-stg"
      + name           = "app-insights-connection-string"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "my-time-api-stg"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/my-time-api.git"
          + "application"         = "my-time"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#my-time-tech"
          + "environment"         = "staging"
          + "managedBy"           = "My Time - Tracking Leave Project"
        }
    }

  # module.my-time-database-v11.azurerm_postgresql_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + login               = "DTS Platform Operations"
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + resource_group_name = "my-time-api-postgres-db-v11-data-stg"
      + server_name         = "my-time-api-postgres-db-v11-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.my-time-database-v11.azurerm_postgresql_database.postgres-db will be created
  + resource "azurerm_postgresql_database" "postgres-db" {
      + charset             = "utf8"
      + collation           = "en-GB"
      + id                  = (known after apply)
      + name                = "mytime"
      + resource_group_name = "my-time-api-postgres-db-v11-data-stg"
      + server_name         = "my-time-api-postgres-db-v11-stg"
    }

  # module.my-time-database-v11.azurerm_postgresql_server.postgres-paas will be created
  + resource "azurerm_postgresql_server" "postgres-paas" {
      + administrator_login              = "my-time"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = 35
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = true
      + id                               = (known after apply)
      + location                         = "uksouth"
      + name                             = "my-time-api-postgres-db-v11-stg"
      + public_network_access_enabled    = false
      + resource_group_name              = "my-time-api-postgres-db-v11-data-stg"
      + sku_name                         = "GP_Gen5_2"
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = 51200
      + tags                             = {
          + "BuiltFrom"           = "https://github.com/HMCTS/my-time-api.git"
          + "application"         = "my-time"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#my-time-tech"
          + "environment"         = "staging"
          + "managedBy"           = "My Time - Tracking Leave Project"
        }
      + version                          = "11"
    }

  # module.my-time-database-v11.azurerm_private_endpoint.postgres[0] will be created
  + resource "azurerm_private_endpoint" "postgres" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "my-time-stg-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "my-time-api-postgres-db-v11-data-stg"
      + subnet_id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/iaas"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/my-time-api.git"
          + "application"         = "my-time"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#my-time-tech"
          + "environment"         = "staging"
          + "managedBy"           = "My Time - Tracking Leave Project"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "postgres-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "my-time-stg-db"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "postgresqlServer",
            ]
        }
    }

  # module.my-time-database-v11.azurerm_resource_group.data-resourcegroup will be created
  + resource "azurerm_resource_group" "data-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "my-time-api-postgres-db-v11-data-stg"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/my-time-api.git"
          + "application"         = "my-time"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#my-time-tech"
          + "environment"         = "staging"
          + "managedBy"           = "My Time - Tracking Leave Project"
        }
    }

  # module.my-time-database-v11.null_resource.set-user-permissions[0] will be created
  + resource "null_resource" "set-user-permissions" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "name"           = "my-time-api-postgres-db-v11"
          + "script_hash"    = "f6e30acec7d742bb8de09d51ea3724cedb22a597c641336ed4f8aecd58283229"
        }
    }

  # module.my-time-database-v11.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":24,"Program":"tfcmt","SHA1":"","Vars":{}} -->